W4D4/MusicApp/app/models/user.rb

  def reset_session_token
    self.session_token = SecureRandom.urlsafe_base64(16)
    self.save!
---
UPDATE "users" SET "session_token" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["session_token", "Q-cu_ug86p7GWqcw_SJ_bQ"], ["updated_at", "2019-01-31 22:04:32.621606"], ["id", 5]]